# coding:utf8


ASSET_TYPE = (
    (1, "物理机"),
    (2, "虚拟机"),
    (3, "交换机"),
    (4, "路由器"),
    (5, "防火墙"),
    (6, "Docker"),
    (7, "其他")
)

ASSET_STATUS = (
    (str(1), "使用中"),
    (str(2), "未使用"),
    (str(3), "故障"),
    (str(4), "其它"),
)

MAP_TYPE = (
    (str(1), "外网"),
    (str(2), "内网"),
)

AuditFlow_LEVEL = (
    (str(1), "一层审核"),
    (str(2), "二层审核"),
    (str(3), "三层审核"),
)

User_TYPE = (
    (0, '---------'),
    (1, '应用运维'),
    (2, '系统运维'),
    (3, '基础运维'),
    (4, 'dba运维'),
    (5, 'IT支持'),
    (6, '开发'),
    (7, '测试'),
    (8, '产品'),
    (9, '其他'),
)

Alarm_TYPE = (
    (0, '邮件'),
    (1, '短信'),
    (2, '微信'),
    (3, '钉钉'),
    (4, '电话'),
)

WeiXin_Type = (
    (11, '中间件'),
    (32, '生产ERROR日志'),
    (22, '测试用途'),
    (21, '数据组'),
    (0, '无')

)

Alarm_TYPE_Code = ['mobile', 'dingding', 'email', 'weixin', 'sms']
Log_Type = ['info', 'warn', 'error', 'fatal']
